# Кортежи (tuple) - Практика


# Задание:
# Создайте кортеж оценок студентов за первый семестр:
#    Иванов - 5
#    Петров - 4
#    Кузнецов - 5
#
# И за второй семестр:
#    Иванов - 4
#    Петров - 5
#    Сидоров - 3
#
# Обратите внимание, что после первого семестра Кузнецов перешёл в другую группу,
# поэтому его оценки нет во втором семестре. А Сидоров наоборот с другой группы перешёл в эту.
#
# Выведите средние оценки студентов за каждый семестр.
# !!! Если студент учился в этой группе только 1 семестр, то нужно вывести эту оценку вместо средней.


# Ожидаемый результат:
# ((Иванов, 4.5), (Петров, 4.5), (Кузнецов, 5.0), (Сидоров, 3.0))


# Темы:
#   - Приведение типов (lesson6)
#   - Циклы for (lesson18)
#   - Кортежи (lesson22)


# Ваше решение:

