# Условные операторы - if-elif-else - Практика


# Задание
# Напишите программу, которая запрашивает у пользователя его балл по экзамену (от 0 до 100)
# и выводит соответствующую оценку:

# Если балл от 90 до 100 включительно, программа должна вывести: "Ваша оценка: A"
# Если балл от 80 до 89 включительно, программа должна вывести: "Ваша оценка: B"
# Если балл от 70 до 79 включительно, программа должна вывести: "Ваша оценка: C"
# Если балл от 60 до 69 включительно, программа должна вывести: "Ваша оценка: D"
# Если балл ниже 60, программа должна вывести: "Ваша оценка: F"

# Если пользователь ввёл число не в диапазоне от 0 до 100
# или если введено нечисловое значение, программа должна вывести: "Некорректный балл"


# Темы:
#   - Преобразование типов данных (lesson6),
#   - Математическое сравнение (lesson8),
#   - Функции input() и print() (lesson10)
#   - Условные операторы - if-else (lesson16)
#   - Условные операторы - if-elif-else (lesson17)


# Ваше решение:


