# Условные операторы - Практика

# Задание:
# Пользователь должен ввести number_1 и number_2
# Если хоть одна строка содержит не только цифры, то вывести ошибку "Введены некорректные данные"
# Если обе строки содержат только цифры, то
#     вывести "Кратно" в случае если number_1 кратно number_2
#     вывести "Не кратно" в случае если number_1 не кратно number_2

# Темы:
#   - Преобразование типов данных (lesson6),
#   - Математические операторы (lesson7),
#   - Функции input() и print() (lesson10)
#   - Строки - Методы строк (lesson12)