# Методы списков - Практика


# Задание

# 1. Вам необходимо добавить в список 5 книг по одной.
# 2. Затем Вам нужно добавить ещё 2 книги за 1 раз.
# 3. Нужно вывести список отсортированных книг по алфавиту. Названия книг должны быть в верхнем регистре.
# 4. Удалить одну из книг, указав ее название.
# 5. Нужно вывести итоговый список книг.


# Пример:

# Введите название книги 1: Гарри Поттер
# Введите название книги 2: Властелин колец
# Введите название книги 3: Преступление и наказание
# Введите название книги 4: Мастер и Маргарита
# Введите название книги 5: Анна Каренина
#
# Добавьте еще две книги: Унесенные ветром, Война и мир
#
# Список книг в верхнем регистре: ['ГАРРИ ПОТТЕР', 'ВЛАСТЕЛИН КОЛЕЦ', 'ПРЕСТУПЛЕНИЕ И НАКАЗАНИЕ', 'МАСТЕР И МАРГАРИТА', 'АННА КАРЕНИНА', 'УНЕСЕННЫЕ ВЕТРОМ', 'ВОЙНА И МИР']
#
# Введите название книги для удаления: Война и мир
# Итоговый список книг: ['ГАРРИ ПОТТЕР', 'ВЛАСТЕЛИН КОЛЕЦ', 'ПРЕСТУПЛЕНИЕ И НАКАЗАНИЕ', 'МАСТЕР И МАРГАРИТА', 'АННА КАРЕНИНА', 'УНЕСЕННЫЕ ВЕТРОМ']


# Темы:
#   - Функции input() и print() (lesson10)
#   - Строки - Форматирование строк (lesson11)
#   - Циклы for (lesson18)
#   - Списки (lesson19)
#   - Методы списков (lesson20)