# Функции - Практика


# Задание 1
# Напишите функцию factorial, которая вычисляет факториал заданного неотрицательного целого числа.
# Например, факториал 5 равен 5 × 4 × 3 × 2 × 1 = 120.

# Ваше решение:


# Задание 2
# Напишите функцию fibonacci, которая вычисляет n-ый член последовательности Фибоначчи.
# Последовательность Фибоначчи — это последовательность чисел, в которой
# первые два числа равны единице, а каждое последующее число равно сумме двух предыдущих чисел.
# Например, 1, 1, 2, 3, 5, 8, 13, 21, 34, ...

# Ваше решение:

