# Set comprehensions - Практика #1

# Задание
# Вам необходимо написать программу для анализа данных интернет-магазина.
# Каждая запись содержит название товара и его цену.
#
# 1. Используя set comprehensions, создайте множество уникальных товаров,
# которые были заказаны хотя бы один раз.
# 2. Найдите товары, которые были заказаны более одного раза.
# 3. Создайте множество уникальных цен, которые встречаются в списке заказов.
# 4. Найдите товары, цена которых превышает $1000, и сформируйте множество их названий.

orders = [
    ("iPhone 13", 900),
    ("Samsung Galaxy", 700),
    ("iPhone 13", 900),
    ("MacBook Air", 1100),
    ("HP Pavilion", 800),
    ("Samsung Galaxy", 700),
    ("Dell Desktop", 750),
    ("MacBook Air", 1100),
    ("Apple iMac", 1500),
    ("Dell Desktop", 750),
]


# Множество уникальных товаров
# Ваш код


# Множество товаров, которые были заказаны более одного раза.
# Ваш код


# Множество уникальных цен
# Ваш код


# Множество товаров, цена которых превышает $1000
# Ваш код
