# Урок 4. Переменные

# Правила названия переменных

# 1. Начинается с буквы или _
# 2. Может содержать буквы, цифры, _
# 3. Нельзя использовать ключевые слова (if, for, while, etc.)

width = 10
name = "John"
article_title = "My article"

# Правила хорошего тона названия переменных

# 1. Осмысленные названия переменных (width, height, length, etc.)
# 2. Старайтесь делать названия переменных не сильно длинными
# 3. Если название переменной содержит несколько слов, то используйте camelCase или _

# Пример
myName = "John"
my_age = 25

his_age = my_age

print(id(his_age))
print(id(my_age))
